; domain
; PolyCraft advanced domain

(define (domain PolyCraft)

    (:requirements :strips :typing :negative-preconditions :fluents :disjunctive-preconditions)

    (:types
        cell - object
    )

    (:constants
        crafting_table - cell
    )

    (:predicates
        (position ?c - cell)

        ; Map
        (tree_cell ?c - cell)
        (air_cell ?c - cell)
        (crafting_table_cell ?c - cell)
        (have_pogo_stick)
    )

    (:functions
        ; Items
        (count_log_in_inventory)
        (count_planks_in_inventory)
        (count_stick_in_inventory)
        (count_sack_polyisoprene_pellets_in_inventory)
        (count_tree_tap_in_inventory)
    )

    ; Actions
    (:action TP_TO
        :parameters (?from - cell ?to - cell)
        :precondition (and
            (position ?from)
        )
        :effect (and
            (not (position ?from))
            (position ?to)
        )
    )

    (:action BREAK
        :parameters (?pos - cell)
        :precondition (and
            (position ?pos)
            (tree_cell ?pos)
        )
        :effect (and
            (not (tree_cell ?pos))
            (air_cell ?pos)
            (increase (count_log_in_inventory) 1)
        )
    )

    (:action CRAFT_PLANK
        :parameters ()
        :precondition (and
            (>= (count_log_in_inventory) 1)
        )
        :effect (and
            (decrease (count_log_in_inventory) 1)
            (increase (count_planks_in_inventory) 4)
        )
    )

    (:action CRAFT_STICK
        :parameters ()
        :precondition (and
            (>= (count_planks_in_inventory) 2)
        )
        :effect (and
            (decrease (count_planks_in_inventory) 2)
            (increase (count_stick_in_inventory) 4)
        )
    )

    (:action CRAFT_TREE_TAP
        :parameters (?pos - cell)
        :precondition (and
            (position ?pos)
            (>= (count_planks_in_inventory) 5)
            (>= (count_stick_in_inventory) 1)
        )
        :effect (and
            (not (position ?pos))
            (position crafting_table)
            (decrease (count_planks_in_inventory) 5)
            (decrease (count_stick_in_inventory) 1)
            (increase (count_tree_tap_in_inventory) 1)
        )
    )

    (:action CRAFT_WOODEN_POGO
        :parameters (?pos - cell)
        :precondition (and
            (position ?pos)
            (>= (count_planks_in_inventory) 2)
            (>= (count_stick_in_inventory) 4)
            (>= (count_sack_polyisoprene_pellets_in_inventory) 1)
        )
        :effect (and
            (not (position ?pos))
            (position crafting_table)
            (decrease (count_planks_in_inventory) 2)
            (decrease (count_stick_in_inventory) 4)
            (decrease
                (count_sack_polyisoprene_pellets_in_inventory)
                1)
            (have_pogo_stick)
        )
    )

    (:action PLACE_TREE_TAP
        :parameters (?pos - cell)
        :precondition (and
            (position ?pos)
            (tree_cell ?pos)
            (>= (count_tree_tap_in_inventory) 1)
        )
        :effect (and
            (increase
                (count_sack_polyisoprene_pellets_in_inventory)
                1)
        )
    )

)

; problem
(define (problem instance_825)
	(:domain PolyCraft)
	(:objects
		cell0 cell1 cell2 cell3 cell4 cell5 cell6 cell7 cell8 cell9 cell10 cell11 cell12 cell13 cell14 cell15 cell16 cell17 cell18 cell19 cell20 cell22 cell23 cell24 cell25 cell26 cell27 cell28 cell29 cell30 cell31 cell32 cell33 cell34 cell35 - cell
	)
	(:init (position cell8) (air_cell cell0) (air_cell cell1) (air_cell cell2) (air_cell cell3) (air_cell cell4) (air_cell cell5) (air_cell cell6) (air_cell cell7) (air_cell cell8) (air_cell cell9) (air_cell cell10) (air_cell cell11) (air_cell cell12) (air_cell cell13) (air_cell cell15) (air_cell cell17) (air_cell cell18) (air_cell cell20) (air_cell cell22) (air_cell cell23) (air_cell cell24) (air_cell cell25) (air_cell cell26) (air_cell cell27) (air_cell cell28) (air_cell cell29) (air_cell cell30) (air_cell cell31) (air_cell cell32) (air_cell cell33) (air_cell cell34) (air_cell cell35) (tree_cell cell14) (tree_cell cell16) (tree_cell cell19)
		(crafting_table_cell crafting_table) (= (count_log_in_inventory) 6) (= (count_planks_in_inventory) 2) (= (count_stick_in_inventory) 0) (= (count_sack_polyisoprene_pellets_in_inventory) 0) (= (count_tree_tap_in_inventory) 0)
	)
	(:goal
		(and
			(have_pogo_stick)
		)
	)
)

; plan
1. (tp_to cell8 cell35)
   deleted: (position cell8)
   added: (position cell35)
   goals met: 0 of 1
2. (craft_plank)
   changed: (count_log_in_inventory) from 6 to 5, (count_planks_in_inventory) from 2 to 6
   goals met: 0 of 1
3. (craft_stick)
   changed: (count_planks_in_inventory) from 6 to 4, (count_stick_in_inventory) from 0 to 4
   goals met: 0 of 1
4. (craft_plank)
   changed: (count_log_in_inventory) from 5 to 4, (count_planks_in_inventory) from 4 to 8
   goals met: 0 of 1
5. (tp_to cell35 cell19)
   deleted: (position cell35)
   added: (position cell19)
   goals met: 0 of 1
6. (craft_tree_tap cell19)
   deleted: (position cell19)
   added: (position crafting_table)
   changed: (count_planks_in_inventory) from 8 to 3, (count_stick_in_inventory) from 4 to 3, (count_tree_tap_in_inventory) from 0 to 1
   goals met: 0 of 1
7. (tp_to crafting_table cell19)
   deleted: (position crafting_table)
   added: (position cell19)
   goals met: 0 of 1
8. (place_tree_tap cell19)
   changed: (count_sack_polyisoprene_pellets_in_inventory) from 0 to 1
   goals met: 0 of 1
9. (tp_to cell19 crafting_table)
   deleted: (position cell19)
   added: (position crafting_table)
   goals met: 0 of 1
10. (craft_stick)
   changed: (count_planks_in_inventory) from 3 to 1, (count_stick_in_inventory) from 3 to 7
   goals met: 0 of 1
11. (craft_plank)
   changed: (count_log_in_inventory) from 4 to 3, (count_planks_in_inventory) from 1 to 5
   goals met: 0 of 1
12. (craft_wooden_pogo crafting_table)
   added: (have_pogo_stick)
   changed: (count_planks_in_inventory) from 5 to 3, (count_stick_in_inventory) from 7 to 3, (count_sack_polyisoprene_pellets_in_inventory) from 1 to 0
   goals met: 1 of 1
